namespace Suncheon
{
    public enum LibName
    {
        삼산도서관 = 0,
        그림책도서관 = 1,
        연향도서관 = 2,
        기적의도서관 = 3,
        조례호수도서관 = 4,
        신대도서관 = 5,
        물의광장 = 6,
        오천그린광장 = 7,
        None = 99,
    }

    public enum SpawnerPos
    {
        삼산도서관 = 0,
        그림책도서관 = 1,
        연향도서관 = 2,
        기적의도서관 = 3,
        조례호수도서관 = 4,
        신대도서관 = 5,
        물의광장 = 6,
        오천그린광장 = 7,
        소그룹동아리,
        중그룹동아리,
        시청각실,
        어린이실,
        자료실,
        개인서재,
        OX퀴즈,
        None = 99,
    }
}